package main

import (
	"fmt"
)

func main() {
	var s = []string{"1", "2", "3"} //создаем слайс из 3 элементов, len = 3, cup = 3 s = [1,2,3]
	modifySlice(s)
	fmt.Println(s) // вывод [3 2 3]
	// Слайс - это структура, содержащая указатель на базовый массив, длинну и емкость
}

func modifySlice(i []string) {
	i[0] = "3"         // len = 3, cup = 3 i = [3,2,3]       len = 3, cup = 3 s = [3,2,3]
	i = append(i, "4") // происходит алоцирование памяти, теперь указатель ссылается на новую ячейку памяти,
	//далее в программе базовый массив остается неизменным
	// len = 4, cup = 6 i = [3,2,3,4]       len = 3, cup = 3 s = [3,2,3]
	i[1] = "5"         // len = 4, cup = 6 i = [3,5,3,4]       len = 3, cup = 3 s = [3,2,3]
	i = append(i, "6") // len = 5, cup = 6 i = [3,5,3,4,6]       len = 3, cup = 3 s = [3,2,3]
}
